src/Documents/АвансовыйОтчет/АвансовыйОтчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АвансовыйОтчет</name>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Подотчет</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииАвансовогоОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ВидОперацииАвансовогоОтчета/ВидОперацииАвансовогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииАвансовогоОтчета</name>
  <enumValues>
    <name>ОтчетЗаТоварыУслуги</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

src/Documents/АвансовыйОтчет/Forms/Документ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		ОбщийДокументы.НачальноеЗаполнение ( Объект );
		Объект.ДатаОперации = ТекущаяДата ();
	Иначе
		// код ...	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении ( Элемент )
	
	установитьВидимостьРеквизитов ();	
	
КонецПроцедуры

&НаКлиенте
Процедура установитьВидимостьРеквизитов ()
	
	Элементы.Касса.Видимость = ( Объект.ВидОперации = ПредопределенноеЗначение ( "Перечисление.ВидОперацииАвансовогоОтчета.Возврат" ) );
	Элементы.Организация.Видимость = ( Объект.ВидОперации = ПредопределенноеЗначение ( "Перечисление.ВидОперацииАвансовогоОтчета.Возврат" ) );
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии ( Отказ )
	
	установитьВидимостьРеквизитов ();	
	
КонецПроцедуры
